Patchoulino/arduino/hardware/boards.txt
##############################################################

menu.build_variant=Build Variant
leonardo.menu.build_variant.leonardo=Leonardo

leonardo.menu.build_variant.leonardo_switch=SwitchJoystick

leonardo.menu.build_variant.leonardo_switch.name=SwitchJoystick
leonardo.menu.build_variant.leonardo_switch.vid.0=0x0F0D
leonardo.menu.build_variant.leonardo_switch.pid.0=0x8092
leonardo.menu.build_variant.leonardo_switch.vid.1=0x0F0D
leonardo.menu.build_variant.leonardo_switch.pid.1=0x0092

leonardo.menu.build_variant.leonardo_switch.upload.tool=avrdude
leonardo.menu.build_variant.leonardo_switch.upload.protocol=avr109
leonardo.menu.build_variant.leonardo_switch.upload.maximum_size=28672
leonardo.menu.build_variant.leonardo_switch.upload.maximum_data_size=2560
leonardo.menu.build_variant.leonardo_switch.upload.speed=57600
leonardo.menu.build_variant.leonardo_switch.upload.disable_flushing=true
leonardo.menu.build_variant.leonardo_switch.upload.use_1200bps_touch=true
leonardo.menu.build_variant.leonardo_switch.upload.wait_for_upload_port=true

leonardo.menu.build_variant.leonardo_switch.bootloader.tool=avrdude
leonardo.menu.build_variant.leonardo_switch.bootloader.low_fuses=0xff
leonardo.menu.build_variant.leonardo_switch.bootloader.high_fuses=0xd8
leonardo.menu.build_variant.leonardo_switch.bootloader.extended_fuses=0xcb
leonardo.menu.build_variant.leonardo_switch.bootloader.file=caterina/Caterina-Leonardo.hex
leonardo.menu.build_variant.leonardo_switch.bootloader.unlock_bits=0x3F
leonardo.menu.build_variant.leonardo_switch.bootloader.lock_bits=0x2F

leonardo.menu.build_variant.leonardo_switch.build.mcu=atmega32u4
leonardo.menu.build_variant.leonardo_switch.build.f_cpu=16000000L
leonardo.menu.build_variant.leonardo_switch.build.vid=0x0F0D
leonardo.menu.build_variant.leonardo_switch.build.pid=0x0092
leonardo.menu.build_variant.leonardo_switch.build.usb_product="POKKEN CONTROLLER"
leonardo.menu.build_variant.leonardo_switch.build.board=AVR_LEONARDO
leonardo.menu.build_variant.leonardo_switch.build.core=arduino
leonardo.menu.build_variant.leonardo_switch.build.variant=leonardo
leonardo.menu.build_variant.leonardo_switch.build.extra_flags={build.usb_flags}

leonardo.menu.build_variant.leonardo_switch.build.usb_manufacturer="HORI CO.,LTD."

##############################################################